#include <stdio.h>
#include <stdlib.h>


/*
Написать программу, в которой создается одномерный числовой массив. 
После заполнения значениями (случайными числами) массива в нем нужно 
выполнить циклическую перестановку элементов. Количество позиций 
для циклической перестановки вводится пользователем с клавиатуры.
*/

int main()
{
    int n, shift;
    printf("Enter array length: ");
    scanf("%d", &n);

    printf("Enter shift : ");
    scanf("%d", &n);

    return 0;
}
